Repository: AndreuSerraCandela/GoogleDrive
Catalog: Translations/GoogleDrive.*.xlf
Languages: es_es

# Page 778823480 - Action 1092037148 - Property 1295455071
source: Tests the connection with Google Drive using the current configuration.
es_es: Prueba la conexión con Google Drive usando la configuración actual.

# Page 778823480 - Action 1092037148 - Property 2879900210
source: Test Connection
es_es: Prueba de conexión

# Page 778823480 - Action 3216480089 - Property 1295455071
source: Verifies if the current token is valid and not expired.
es_es: Verifica si el token actual es válido y no ha expirado.

# Page 778823480 - Action 3216480089 - Property 2879900210
source: Test Token Validity
es_es: Prueba de validez del token

# Page 778823480 - Action 3388314106 - Property 1295455071
source: Validates that all configuration fields are complete.
es_es: Valida que todos los campos de configuración estén completos.

# Page 778823480 - Action 3388314106 - Property 2879900210
source: Validate Configuration
es_es: Validar configuración

# Page 778823480 - Action 3825920327 - Property 1295455071
source: Update the access token using the refresh token.
es_es: Actualiza el token de acceso usando el refresh token.

# Page 778823480 - Action 3825920327 - Property 2879900210
source: Update Token
es_es: Actualizar Token

# Page 778823480 - Action 150691378 - Property 1295455071
source: Gets the ID of the OneDrive site.
es_es: Obtiene el ID del sitio de OneDrive.

# Page 778823480 - Action 2053509897 - Property 1295455071
source: Starts the OAuth authentication process with OneDrive.
es_es: Inicia el proceso de autenticación OAuth con OneDrive.

# Page 778823480 - Action 2053509897 - Property 2879900210
source: Start OAuth
es_es: Iniciar OAuth

# Page 778823480 - Action 310815148 - Property 1295455071
source: Tests the connection with OneDrive using the current configuration.
es_es: Prueba la conexión con OneDrive usando la configuración actual.

# Page 778823480 - Action 310815148 - Property 2879900210
source: Test Connection
es_es: Prueba de conexión

# Page 778823480 - Action 1255083178 - Property 1295455071
source: Validates that all configuration fields are complete.
es_es: Valida que todos los campos de configuración estén completos.

# Page 778823480 - Action 1255083178 - Property 2879900210
source: Validate Configuration
es_es: Validar configuración

# Page 778823480 - Action 2584611400 - Property 1295455071
source: Update the access token using the refresh token.
es_es: Actualiza el token de acceso usando el refresh token.

# Page 778823480 - Action 2584611400 - Property 2879900210
source: Update Token
es_es: Actualizar Token

# Page 778823480 - Action 824331786 - Property 1295455071
source: Starts the OAuth authentication process with SharePoint.
es_es: Inicia el proceso de autenticación OAuth con SharePoint.

# Page 778823480 - Action 824331786 - Property 2879900210
source: Start OAuth
es_es: Iniciar OAuth

# Page 778823480 - Action 2593449353 - Property 1295455071
source: Tests the SharePoint API with the current configuration.
es_es: Prueba la API de SharePoint usando la configuración actual.

# Page 778823480 - Action 2593449353 - Property 2879900210
source: Test API
es_es: Prueba de API

# Page 778823480 - Action 3482243243 - Property 1295455071
source: Tests the connection with SharePoint using the current configuration.
es_es: Prueba la conexión con SharePoint usando la configuración actual.

# Page 778823480 - Action 3482243243 - Property 2879900210
source: Test Connection
es_es: Prueba de conexión

# Page 778823480 - Action 2624363185 - Property 1295455071
source: Validates that all configuration fields are complete.
es_es: Valida que todos los campos de configuración estén completos.

# Page 778823480 - Action 2624363185 - Property 2879900210
source: Validate Configuration
es_es: Validar configuración

# Page 778823480 - Action 946036147 - Property 1295455071
source: Shows the user manual for the Drive.
es_es: Muestra el manual del usuario para el Drive.

# Page 778823480 - Action 946036147 - Property 2879900210
source: Show Manual
es_es: Mostrar manual

# Page 778823480 - Action 1885231133 - Property 1295455071
source: Tests the Strapi API with the current configuration.
es_es: Prueba la API de Strapi usando la configuración actual.

# Page 778823480 - Action 1885231133 - Property 2879900210
source: Test API
es_es: Prueba de API

# Page 778823480 - Action 3844658391 - Property 1295455071
source: Tests the connection with Strapi using the current configuration.
es_es: Prueba la conexión con Strapi usando la configuración actual.

# Page 778823480 - Action 3844658391 - Property 2879900210
source: Test Connection
es_es: Prueba de conexión

# Page 778823480 - Action 3218507621 - Property 1295455071
source: Validates that all configuration fields are complete.
es_es: Valida que todos los campos de configuración estén completos.

# Page 778823480 - Action 3218507621 - Property 2879900210
source: Validate Configuration
es_es: Validar configuración

# Page 4176554980 - Property 2879900210
source: Drive Factbox
es_es: Factbox Drive

# Page 4176554980 - NamedType 1518692370
source: Folder "%1" created successfully.
es_es: Carpeta "%1" creada correctamente.

# Page 4176554980 - NamedType 2597770267
source: No destination selected.
es_es: No se ha seleccionado un destino.

# Page 4176554980 - NamedType 684082520
source: Cannot go up to previous level, you are at the root level for this record.
es_es: No se puede subir al nivel anterior, ya está en el nivel raíz para este registro.

# Page 4176554980 - Control 3414364457 - Property 2879900210
source: Extension
es_es: Extensión

# Page 4176554980 - Control 2961552353 - Property 2879900210
source: Name
es_es: Nombre

# Page 4176554980 - Control 1131619133 - Property 2879900210
source: Type
es_es: Tipo

# Page 4176554980 - Action 2795442286 - Property 1295455071
source: Creates a folder in cloud storage.
es_es: Crea una carpeta en el almacenamiento en la nube.

# Page 4176554980 - Action 2795442286 - Property 2879900210
source: Create Folder
es_es: Crear Carpeta

# Page 4176554980 - Action 2771780305 - Property 1295455071
source: Opens the file in the cloud storage for editing.
es_es: Abre el archivo en el almacenamiento en la nube para editar.

# Page 4176554980 - Action 2771780305 - Property 2879900210
source: Edit in Drive
es_es: Editar en Drive

# Page 4176554980 - Action 2061727743 - Property 2879900210
source: Move
es_es: Mover

# Page 1163388225 - Property 2879900210
source: Drive Folder Mapping
es_es: Mapeo de Carpetas de Drive

# Page 1163388225 - NamedType 4039018142
source: Could not generate subfolder path. Verify the configuration.
es_es: No es posible generar la ruta de la subcarpeta. Verifique la configuración.

# Page 1163388225 - NamedType 3981014873
source: ❌ Error creating test subfolder.
es_es: ❌ Error al crear la subcarpeta de prueba.

# Page 1163388225 - NamedType 2022272445
source: ✅ Successful folder access. Found %1 items.
es_es: ✅ Acceso a la carpeta exitoso. Se encontraron %1 elementos.

# Page 1163388225 - NamedType 3095192917
source: Folder browser functionality will be implemented soon.\For now, you can get the folder ID from Google Drive:\1. Open Google Drive in your browser\2. Navigate to the desired folder\3. Copy the ID from the URL (the part after /folders/)
es_es: La funcionalidad de explorador de carpetas se implementará pronto.\Por ahora, puede obtener el ID de la carpeta desde Google Drive:\1. Abra Google Drive en su navegador\2. Navegue hasta la carpeta deseada\3. Copie el ID de la URL (la parte después de /folders/)

# Page 1163388225 - NamedType 3902951687
source: ⚠️ The folder is empty or could not be accessed. Verify the folder ID and permissions.
es_es: ⚠️ La carpeta está vacía o no se puede acceder. Verifique el ID de la carpeta y los permisos.

# Page 1163388225 - NamedType 2968485544
source: Please specify a folder ID first.
es_es: Por favor, especifique un ID de carpeta primero.

# Page 1163388225 - NamedType 1412058955
source: This page allows you to configure where files from different tables will be stored in Drive.\Use "Setup Default Mappings" to create initial configurations.
es_es: Esta página le permite configurar dónde se almacenarán los archivos de diferentes tablas en Drive.\Use "Setup Default Mappings" to create initial configurations.

# Page 1163388225 - NamedType 508573679
source: ✅ Test subfolder created successfully.\Folder ID: %1
es_es: ✅ Subcarpeta de prueba creada correctamente.\ID de la carpeta: %1

# Page 1163388225 - Control 1090351696 - Property 1295455071
source: Specifies if this configuration is active.
es_es: Especifica si esta configuración está activa.

# Page 1163388225 - Control 825495798 - Property 1295455071
source: If enabled, it will automatically create subfolders based on the specified pattern.
es_es: Si está habilitado, creará automáticamente subcarpetas basadas en el patrón especificado.

# Page 1163388225 - Control 2500892784 - Property 1295455071
source: Date and time when this record was created.
es_es: Fecha y hora de creación de este registro.

# Page 1163388225 - Control 1127021900 - Property 1295455071
source: Specifies the ID of the Drive folder where files will be stored.
es_es: Especifica el ID de la carpeta del Drive donde se almacenarán los archivos.

# Page 1163388225 - Control 141400118 - Property 1295455071
source: Specifies the name of the Drive folder (for reference only).
es_es: Especifica el nombre de la carpeta del Drive (solo para referencia).

# Page 1163388225 - Control 3461834954 - Property 1295455071
source: Optional description for this configuration.
es_es: Descripción opcional para esta configuración.

# Page 1163388225 - Control 699646855 - Property 1295455071
source: Date and time when this record was last modified.
es_es: Fecha y hora de última modificación de este registro.

# Page 1163388225 - Control 2782705678 - Property 1295455071
source: Pattern for creating subfolders. Use {DOCNO} for document number, {NO} for Code, {YEAR} for year, {MONTH} for month.
es_es: Patrón para crear subcarpetas. Use {DOCNO} para número de documento, {NO} para el Código, {YEAR} para año, {MONTH} para mes.

# Page 1163388225 - Control 3135334477 - Property 1295455071
source: Specifies the ID of the Business Central table.
es_es: Especifica el ID de la tabla de Business Central.

# Page 1163388225 - Control 3808951907 - Property 1295455071
source: Shows the name of the Business Central table.
es_es: Muestra el nombre de la tabla de Business Central.

# Page 1163388225 - Control 4275393692 - Property 2879900210
source: Drive Folders
es_es: Carpetas de Drive

# Page 1163388225 - Action 3126609683 - Property 1295455071
source: Opens Drive in the browser.
es_es: Abre el Drive en el navegador.

# Page 1163388225 - Action 3126609683 - Property 2879900210
source: Open Drive
es_es: Abrir Drive

# Page 1163388225 - Action 3071540127 - Property 1295455071
source: Opens the Google Drive browser to select a folder.
es_es: Abre el explorador de Google Drive para seleccionar una carpeta.

# Page 1163388225 - Action 3071540127 - Property 2879900210
source: Browse Drive Folder
es_es: Explorar Carpeta Drive

# Page 1163388225 - Action 2041472052 - Property 1295455071
source: Creates a test subfolder using the specified pattern.
es_es: Crea una subcarpeta de prueba usando el patrón especificado.

# Page 1163388225 - Action 2041472052 - Property 2879900210
source: Create Test Subfolder
es_es: Crear Subcarpeta de Prueba

# Page 1163388225 - Action 1800816931 - Property 1295455071
source: Retrieves the ID of the specified folder.
es_es: Recupera el ID de la carpeta especificada.

# Page 1163388225 - Action 1800816931 - Property 2879900210
source: Retrieve Folder ID
es_es: Recuperar ID de Carpeta

# Page 1163388225 - Action 284370949 - Property 1295455071
source: Creates default configurations for the most common tables.
es_es: Crea configuraciones por defecto para las tablas más comunes.

# Page 1163388225 - Action 284370949 - Property 2879900210
source: Setup Default Mappings
es_es: Configurar Mapeos por Defecto

# Page 1163388225 - Action 178287432 - Property 1295455071
source: Tests if the specified folder can be accessed.
es_es: Prueba si se puede acceder a la carpeta especificada.

# Page 1163388225 - Action 178287432 - Property 2879900210
source: Test Folder Access
es_es: Probar Acceso a Carpeta

# Page 1387985265 - Property 2879900210
source: Drive List
es_es: Lista de Drive

# Page 1387985265 - NamedType 1518692370
source: Folder "%1" created successfully.
es_es: Carpeta "%1" creada correctamente.

# Page 1387985265 - NamedType 2597770267
source: No destination selected.
es_es: No se ha seleccionado un destino.

# Page 1387985265 - NamedType 684082520
source: Cannot go up to previous level, you are at the root level for this record.
es_es: No se puede subir al nivel anterior, ya está en el nivel raíz para este registro.

# Page 1387985265 - Control 3414364457 - Property 2879900210
source: Extension
es_es: Extensión

# Page 1387985265 - Control 2961552353 - Property 2879900210
source: Name
es_es: Nombre

# Page 1387985265 - Control 1131619133 - Property 2879900210
source: Type
es_es: Tipo

# Page 1387985265 - Action 1939812918 - Property 1295455071
source: Create a folder in the Drive
es_es: Crea una carpeta en el Drive

# Page 1387985265 - Action 1939812918 - Property 2879900210
source: Create Folder
es_es: Crear Carpeta

# Page 3811955462 - NamedType 452344817
source: Error: Permission to modify the Document Attachment record is missing
es_es: Error: Falta permiso para modificar el registro de Documento Adjunto

# PageExtension 2049204610 - Control 2967437008 - Property 2879900210
source: Documents
es_es: Documentos

# PageExtension 2049204610 - Control 4169497700 - Property 2879900210
source: Drive Files
es_es: Archivos de Drive

# PageExtension 2049204610 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 1814822428 - Action 778823480 - Property 2879900210
source: Storage Configuration
es_es: Configuración de Almacenamiento

# PageExtension 1713901351 - Control 4169497700 - Property 2879900210
source: Drive Files
es_es: Archivos de Drive

# PageExtension 1713901351 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 705205957 - NamedType 2734773568
source: Are you sure you want to delete the file "%1"?
es_es: ¿Está seguro de que desea eliminar el archivo "%1"?

# PageExtension 705205957 - NamedType 2047794589
source: Documents moved successfully to Drive.
es_es: Documentos movidos correctamente al Drive.

# PageExtension 705205957 - NamedType 56147532
source: Error deleting file.
es_es: Error al eliminar el archivo.

# PageExtension 705205957 - NamedType 3871679643
source: Error moving documents: %1
es_es: Error al mover los documentos: %1

# PageExtension 705205957 - NamedType 3790416548
source: File deleted successfully.
es_es: Archivo eliminado correctamente.

# PageExtension 705205957 - NamedType 212811175
source: Folder "%1" created successfully.
es_es: Carpeta "%1" creada correctamente.

# PageExtension 705205957 - NamedType 452344817
source: Error: Permission to modify the Document Attachment record is missing
es_es: Error: Falta permiso para modificar el registro de Documento Adjunto

# PageExtension 705205957 - NamedType 2683350415
source: Are you sure you want to move the selected documents to Drive? The documents will be removed from local storage.
es_es: ¿Está seguro de que desea mover los documentos seleccionados al Drive? Los documentos se eliminarán del almacenamiento local.

# PageExtension 705205957 - NamedType 1477235810
source: No destination selected
es_es: No se ha seleccionado un destino

# PageExtension 705205957 - Action 1584223161 - Property 1295455071
source: Moves selected documents to Drive and removes them from local storage.
es_es: Mueve los documentos seleccionados al Drive y los elimina del almacenamiento local.

# PageExtension 705205957 - Action 1584223161 - Property 2879900210
source: Move to Drive
es_es: Mover a Drive

source: Are you sure you want to move the selected documents to Drive? The documents will be removed from local storage.
es_es: ¿Está seguro de que desea mover los documentos seleccionados al Drive? Los documentos se eliminarán del almacenamiento local.

source: Documents moved successfully to Drive.
es_es: Documentos movidos correctamente al Drive.

source: Error moving documents: %1
es_es: Error al mover los documentos: %1

# PageExtension 705205957 - Action 1586971679 - Property 2879900210
source: Load file from drive
es_es: Cargar archivo desde drive

# PageExtension 705205957 - Action 2473526021 - Property 1295455071
source: Copies the file to another folder.
es_es: Copia el archivo a otra carpeta.

# PageExtension 705205957 - Action 2473526021 - Property 2879900210
source: Copy File
es_es: Copiar Archivo

# PageExtension 705205957 - Action 2795442286 - Property 1295455071
source: Creates a folder in cloud storage.
es_es: Crea una carpeta en el almacenamiento en la nube.

# PageExtension 705205957 - Action 2795442286 - Property 2879900210
source: Create Folder
es_es: Crear Carpeta

# PageExtension 705205957 - Action 4193334241 - Property 1295455071
source: Deletes the file from cloud storage.
es_es: Elimina el archivo del almacenamiento en la nube.

# PageExtension 705205957 - Action 4193334241 - Property 2879900210
source: Delete
es_es: Eliminar

source: Are you sure you want to delete the file "%1"?
es_es: ¿Está seguro de que desea eliminar el archivo "%1"?

# PageExtension 705205957 - Action 2787516006 - Property 1295455071
source: Downloads the file from cloud storage.
es_es: Descarga el archivo del almacenamiento en la nube.

# PageExtension 705205957 - Action 2787516006 - Property 2879900210
source: Download File
es_es: Descargar Archivo

# PageExtension 705205957 - Action 2997726620 - Property 1295455071
source: Edits the file in Drive.
es_es: Edita el archivo en Drive.

# PageExtension 705205957 - Action 2997726620 - Property 2879900210
source: Edit in Drive
es_es: Editar en Drive

# PageExtension 705205957 - Action 1081453201 - Property 1295455071
source: Moves the file to another folder.
es_es: Mueve el archivo a otra carpeta.

# PageExtension 705205957 - Action 1081453201 - Property 2879900210
source: Move
es_es: Mover

# PageExtension 705205957 - Control 4259771803 - Property 1295455071
source: Specifies the ID of the file in DropBox.
es_es: Especifica el ID del archivo en DropBox.

# PageExtension 705205957 - Control 4259771803 - Property 2879900210
source: DropBox ID
es_es: ID de DropBox

# PageExtension 705205957 - Control 2352762228 - Property 1295455071
source: Specifies the ID of the file in Google Drive.
es_es: Especifica el ID del archivo en Google Drive.

# PageExtension 705205957 - Control 2352762228 - Property 2879900210
source: Google Drive ID
es_es: ID de Google Drive

# PageExtension 705205957 - Control 943209143 - Property 1295455071
source: Specifies the ID of the file in OneDrive.
es_es: Especifica el ID del archivo en OneDrive.

# PageExtension 705205957 - Control 943209143 - Property 2879900210
source: OneDrive ID
es_es: ID de OneDrive

# PageExtension 705205957 - Control 1360156368 - Property 1295455071
source: Specifies the ID of the file in SharePoint.
es_es: Especifica el ID del archivo en SharePoint.

# PageExtension 705205957 - Control 1360156368 - Property 2879900210
source: SharePoint ID
es_es: ID de SharePoint

# PageExtension 705205957 - Control 387688216 - Property 1295455071
source: Specifies whether the attachment should be stored in DropBox instead of in the database.
es_es: Especifica si el adjunto debe almacenarse en DropBox en lugar de en la base de datos.

# PageExtension 705205957 - Control 387688216 - Property 2879900210
source: Store in DropBox
es_es: Almacenar en DropBox

# PageExtension 705205957 - Control 1404833335 - Property 1295455071
source: Specifies whether the attachment should be stored in Google Drive instead of in the database.
es_es: Especifica si el adjunto debe almacenarse en Google Drive en lugar de en la base de datos.

# PageExtension 705205957 - Control 1404833335 - Property 2879900210
source: Store in Google Drive
es_es: Almacenar en Google Drive

# PageExtension 705205957 - Control 4060001340 - Property 1295455071
source: Specifies whether the attachment should be stored in OneDrive instead of in the database.
es_es: Especifica si el adjunto debe almacenarse en OneDrive en lugar de en la base de datos.

# PageExtension 705205957 - Control 4060001340 - Property 2879900210
source: Store in OneDrive
es_es: Almacenar en OneDrive

# PageExtension 705205957 - Control 2822049787 - Property 1295455071
source: Specifies whether the attachment should be stored in SharePoint instead of in the database.
es_es: Especifica si el adjunto debe almacenarse en SharePoint en lugar de en la base de datos.

# PageExtension 705205957 - Control 2822049787 - Property 2879900210
source: Store in SharePoint
es_es: Almacenar en SharePoint

# PageExtension 705205957 - Control 4079814311 - Property 1295455071
source: Specifies whether the attachment should be stored in Strapi instead of in the database.
es_es: Especifica si el adjunto debe almacenarse en Strapi en lugar de en la base de datos.

# PageExtension 705205957 - Control 4079814311 - Property 2879900210
source: Store in Strapi
es_es: Almacenar en Strapi

# PageExtension 705205957 - Control 770361188 - Property 1295455071
source: Specifies the ID of the file in Strapi.
es_es: Especifica el ID del archivo en Strapi.

# PageExtension 705205957 - Control 770361188 - Property 2879900210
source: Strapi ID
es_es: ID de Strapi

# PageExtension 2924407865 - Control 4169497700 - Property 2879900210
source: Drive Files
es_es: Archivos de Drive

# PageExtension 2924407865 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 393324029 - Control 4169497700 - Property 2879900210
source: Drive Files
es_es: Archivos de Drive

# PageExtension 393324029 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 2950218440 - Control 4169497700 - Property 2879900210
source: Drive Files
es_es: Archivos de Drive

# PageExtension 2950218440 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 1148658026 - Control 4169497700 - Property 2879900210
source: Drive Files
es_es: Archivos de Drive

# PageExtension 1148658026 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 558215147 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 1959436157 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 3032686328 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 3983694059 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 3450204285 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 4130058626 - Control 2967437008 - Property 2879900210
source: Documents
es_es: Documentos

# PageExtension 4130058626 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 558681197 - Control 4169497700 - Property 2879900210
source: Drive Files
es_es: Archivos de Drive

# PageExtension 558681197 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 3083527838 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor Pdf

# PageExtension 1925512004 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor Pdf

# PageExtension 1552137841 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor Pdf
