Repository: AndreuSerraCandela/GoogleDrive
Catalog: Translations/GoogleDrive.*.xlf
Languages: es_es

# PageExtension 3792668686 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor Pdf

# PageExtension 3103464372 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 4254993347 - Control 2967437008 - Property 2879900210
source: Documents
es_es: Documentos

# PageExtension 4254993347 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# PageExtension 3990907967 - Control 4169497700 - Property 2879900210
source: Drive Files
es_es: Archivos de Drive

# PageExtension 3990907967 - Control 822531619 - Property 2879900210
source: PDF Viewer
es_es: Visor PDF

# TableExtension 3595798924 - NamedType 1168643228
source: Are you sure you want to delete root folder?
es_es: ¿Está seguro de querer eliminar la carpeta raíz?

# TableExtension 3595798924 - NamedType 3235761483
source: Are you sure you want to rename root folder?
es_es: ¿Está seguro de querer renombrar la carpeta raíz?

# TableExtension 3595798924 - Field 935246507 - Property 2879900210
source: DropBox Code
es_es: Código de DropBox

# TableExtension 3595798924 - Field 3712334668 - Property 2879900210
source: GoogleDrive Code
es_es: Código de Google Drive

# TableExtension 3595798924 - Field 3096298988 - Property 2879900210
source: Code Ondrive
es_es: Código de OneDrive

# TableExtension 3595798924 - Field 2125396144 - Property 2879900210
source: SharePoint Code
es_es: Código de SharePoint

# TableExtension 3595798924 - Field 1869379388 - Property 2879900210
source: Data Storage Provider
es_es: Proveedor de Almacenamiento de Datos

# TableExtension 3595798924 - Field 4135971357 - Property 2879900210
source: DropBox Access Token
es_es: Token de Acceso de DropBox

# TableExtension 3595798924 - Field 2488241142 - Property 2879900210
source: DropBox App Key
es_es: Clave de Aplicación de DropBox

# TableExtension 3595798924 - Field 128218221 - Property 2879900210
source: DropBox App Secret
es_es: Secreto de Aplicación de DropBox

# TableExtension 3595798924 - Field 2759503982 - Property 2879900210
source: DropBox Refresh Token
es_es: Token de Renovación de DropBox

# TableExtension 3595798924 - Field 1364126888 - Property 2879900210
source: DropBox Token Expiration
es_es: Expiración del Token de DropBox

# TableExtension 3595798924 - Field 246070 - Property 2879900210
source: Google Drive Token Expiration
es_es: Expiración del Token de Google Drive

# TableExtension 3595798924 - Field 1159926083 - Property 2879900210
source: Extended Functionality
es_es: Funcionalidad Extendida

# TableExtension 3595798924 - Field 316178277 - Property 2879900210
source: Google Auth Provider Cert URL
es_es: URL de Certificado de Proveedor de Autenticación de Google

# TableExtension 3595798924 - Field 2951281481 - Property 2879900210
source: Google Auth URI
es_es: URI de Autenticación de Google

# TableExtension 3595798924 - Field 2039669391 - Property 2879900210
source: Google Client ID
es_es: ID de Cliente de Google

# TableExtension 3595798924 - Field 248657298 - Property 2879900210
source: Google Client Secret
es_es: Secreto de Cliente de Google

# TableExtension 3595798924 - Field 244547281 - Property 2879900210
source: Google Drive Manual
es_es: Manual de Google Drive

# TableExtension 3595798924 - Field 2230076268 - Property 2879900210
source: Google Drive Manual Last Update
es_es: Última Actualización del Manual de Google Drive

# TableExtension 3595798924 - Field 3826965379 - Property 2879900210
source: Google Project ID
es_es: ID de Proyecto de Google

# TableExtension 3595798924 - Field 4107414531 - Property 2879900210
source: Google Shared Drive ID
es_es: ID de Drive Compartido de Google

# TableExtension 3595798924 - Field 4026808557 - Property 2879900210
source: Google Shared Drive Name
es_es: Nombre de Drive Compartido de Google

# TableExtension 3595798924 - Field 2371736376 - Property 2879900210
source: Google Token URI
es_es: URI de Token de Google

# TableExtension 3595798924 - Field 1887542201 - Property 2879900210
source: OneDrive Access Token
es_es: Token de Acceso de OneDrive

# TableExtension 3595798924 - Field 1727939672 - Property 2879900210
source: OneDrive Client ID
es_es: ID de Cliente de OneDrive

# TableExtension 3595798924 - Field 4276756505 - Property 2879900210
source: OneDrive Client Secret
es_es: Secreto de Cliente de OneDrive

# TableExtension 3595798924 - Field 1599754090 - Property 2879900210
source: OneDrive Refresh Token
es_es: Token de Renovación de OneDrive

# TableExtension 3595798924 - Field 2549889954 - Property 2879900210
source: OneDrive Site ID
es_es: ID del Sitio de OneDrive

# TableExtension 3595798924 - Field 3330877244 - Property 2879900210
source: OneDrive Site Url
es_es: URL del Sitio de OneDrive

# TableExtension 3595798924 - Field 2653429955 - Property 2879900210
source: OneDrive Tenant ID
es_es: ID del Inquilino de OneDrive

# TableExtension 3595798924 - Field 2119495052 - Property 2879900210
source: OneDrive Token Expiration
es_es: Expiración del Token de OneDrive

# TableExtension 3595798924 - Field 3268871981 - Property 2879900210
source: Google Drive Refresh Token
es_es: Token de Renovación de Google Drive

# TableExtension 3595798924 - Field 752215180 - Property 2879900210
source: Root Folder
es_es: Carpeta Raíz

# TableExtension 3595798924 - Field 1138359575 - Property 2879900210
source: Root Folder ID
es_es: ID de la Carpeta Raíz

# TableExtension 3595798924 - Field 1706501090 - Property 2879900210
source: SharePoint Access Token
es_es: Token de Acceso de SharePoint

# TableExtension 3595798924 - Field 2248734183 - Property 2879900210
source: SharePoint Client ID
es_es: ID del Cliente de SharePoint

# TableExtension 3595798924 - Field 2104195930 - Property 2879900210
source: SharePoint Client Secret
es_es: Secreto del Cliente de SharePoint

# TableExtension 3595798924 - Field 1713108105 - Property 2879900210
source: SharePoint Refresh Token
es_es: Token de Renovación de SharePoint

# TableExtension 3595798924 - Field 1894561681 - Property 2879900210
source: SharePoint Site ID
es_es: ID del Sitio de SharePoint

# TableExtension 3595798924 - Field 76939604 - Property 2879900210
source: SharePoint Tenant ID
es_es: ID del Inquilino de SharePoint

# TableExtension 3595798924 - Field 2682310627 - Property 2879900210
source: SharePoint Token Expiration
es_es: Expiración del Token de SharePoint

# TableExtension 3595798924 - Field 3771291026 - Property 2879900210
source: Strapi API Token
es_es: Token de API de Strapi

# TableExtension 3595798924 - Field 3547209069 - Property 2879900210
source: Strapi Base URL
es_es: URL Base de Strapi

# TableExtension 3595798924 - Field 293695152 - Property 2879900210
source: Strapi Collection Name
es_es: Nombre de Colección de Strapi

# TableExtension 3595798924 - Field 3531253518 - Property 2879900210
source: Strapi Password
es_es: Contraseña de Strapi

# TableExtension 3595798924 - Field 1947287909 - Property 2879900210
source: Strapi Username
es_es: Nombre de Usuario de Strapi

# TableExtension 3595798924 - Field 2763028714 - Property 2879900210
source: Google Drive Token
es_es: Token de Google Drive

# TableExtension 3595798924 - Field 211956657 - Property 2879900210
source: DropBox API URL
es_es: URL de API de DropBox

# TableExtension 3595798924 - Field 1292037474 - Property 2879900210
source: Google Drive API URL
es_es: URL de API de Google Drive

# TableExtension 3595798924 - Field 4002845373 - Property 2879900210
source: OneDrive API URL
es_es: URL de API de OneDrive

# TableExtension 3595798924 - Field 800046590 - Property 2879900210
source: SharePoint API URL
es_es: URL de API de SharePoint

# TableExtension 2969727918 - Field 4259771803 - Property 2879900210
source: DropBox ID
es_es: ID de DropBox

# TableExtension 2969727918 - Field 207334489 - Property 2879900210
source: DropBox URL
es_es: URL de DropBox

# TableExtension 2969727918 - Field 2352762228 - Property 2879900210
source: Google Drive ID
es_es: ID de Google Drive

# TableExtension 2969727918 - Field 4007851642 - Property 2879900210
source: Google Drive URL
es_es: URL de Google Drive

# TableExtension 2969727918 - Field 2012756198 - Property 2879900210
source: Moved Document
es_es: Documento Movido

# TableExtension 2969727918 - Field 943209143 - Property 2879900210
source: OneDrive ID
es_es: ID de OneDrive

# TableExtension 2969727918 - Field 474065885 - Property 2879900210
source: OneDrive URL
es_es: URL de OneDrive

# TableExtension 2969727918 - Field 394833666 - Property 2879900210
source: Posted Document
es_es: Documento Registrado

# TableExtension 2969727918 - Field 1360156368 - Property 2879900210
source: SharePoint ID
es_es: ID de SharePoint

# TableExtension 2969727918 - Field 745197316 - Property 2879900210
source: Storage Provider
es_es: Proveedor de Almacenamiento

# TableExtension 2969727918 - Field 387688216 - Property 2879900210
source: Store in DropBox
es_es: Almacenar en DropBox

# TableExtension 2969727918 - Field 1404833335 - Property 2879900210
source: Store in Google Drive
es_es: Almacenar en Google Drive

# TableExtension 2969727918 - Field 4060001340 - Property 2879900210
source: Store in OneDrive
es_es: Almacenar en OneDrive

# TableExtension 2969727918 - Field 2822049787 - Property 2879900210
source: Store in SharePoint
es_es: Almacenar en SharePoint

# TableExtension 2969727918 - Field 4079814311 - Property 2879900210
source: Store in Strapi
es_es: Almacenar en Strapi

# TableExtension 2969727918 - Field 770361188 - Property 2879900210
source: Strapi ID
es_es: ID de Strapi

# TableExtension 2969727918 - Field 2135425322 - Property 2879900210
source: Strapi URL
es_es: URL de Strapi

# TableExtension 3630998776 - Field 3414364457 - Property 2879900210
source: File Extension
es_es: Extensión de Archivo

# TableExtension 3630998776 - Field 2352762228 - Property 2879900210
source: Google Drive ID
es_es: ID de Google Drive

# TableExtension 3630998776 - Field 656687640 - Property 2879900210
source: Google Drive Parent ID
es_es: ID del Padre de Google Drive
