Repository: AndreuSerraCandela/GoogleDrive
Catalog: Translations/GoogleDrive.*.xlf
Languages: es_es

# Codeunit 3181614269 - NamedType 3355286028
source: Could not get site ID. Verify that the hostname and path are correct.
es_es: No se pudo obtener el ID del sitio. Verifica que el nombre de host y la ruta sean correctos.

# Codeunit 3181614269 - NamedType 1533214092
source: Error getting site drive: %1
es_es: Error al obtener la unidad del sitio: %1

# Codeunit 3181614269 - NamedType 4180489135
source: Could not get site drive ID. Verify that the site ID is correct.
es_es: No se pudo obtener el ID de la unidad del sitio. Verifica que el ID del sitio sea correcto.

# Codeunit 3181614269 - NamedType 3650720228
source: Error getting site: %1
es_es: Error al obtener el sitio: %1

# Codeunit 3181614269 - NamedType 1913763488
source: Error getting site: %1
es_es: Error al obtener el sitio: %1

# Codeunit 3181614269 - NamedType 162173147
source: Could not get site ID. Verify that the site URL is correct.
es_es: No se pudo obtener el ID del sitio. Verifica que la URL del sitio sea correcta.

# Codeunit 3181614269 - NamedType 4062163994
source: No refresh token configured for OneDrive.
es_es: No hay token de actualización configurado para OneDrive.

# Codeunit 3181614269 - NamedType 3924427549
source: No response received from OneDrive server.
es_es: No se recibió respuesta del servidor de OneDrive.

# Codeunit 3181614269 - NamedType 1680919470
source: No response received from OneDrive server.
es_es: No se recibió respuesta del servidor de OneDrive.

# Codeunit 3181614269 - NamedType 3106542267
source: Could not authenticate with OneDrive. Please verify your credentials.
es_es: No se pudo autenticar con OneDrive. Por favor verifica tus credenciales.

# Codeunit 3181614269 - NamedType 2744667805
source: Save
es_es: Guardar

# Codeunit 3181614269 - NamedType 2910491449
source: Error searching sites: %1
es_es: Error al buscar sitios: %1

# Codeunit 3181614269 - NamedType 92766987
source: Sharing is disabled on this site and could not get direct URL. Contact administrator to enable sharing.
es_es: El uso compartido está deshabilitado en este sitio y no se pudo obtener la URL directa. Contacta al administrador para habilitar el uso compartido.

# Codeunit 3181614269 - NamedType 3828855187
source: Sharing is disabled on this site. Using direct file URL.
es_es: El uso compartido está deshabilitado en este sitio. Usando URL directa del archivo.

# Codeunit 3181614269 - NamedType 3621415535
source: Sharing is disabled on this site. Opening direct file URL.
es_es: El uso compartido está deshabilitado en este sitio. Abriendo URL directa del archivo.

# Codeunit 3181614269 - NamedType 1126850388
source: Error accessing file: %1
es_es: Error al acceder al archivo: %1

# Codeunit 3181614269 - NamedType 755306522
source: OneDrive site ID is not configured. Please configure the site ID in the company.
es_es: El ID del sitio de OneDrive no está configurado. Por favor configura el ID del sitio en la empresa.

# Codeunit 3181614269 - NamedType 1488830023
source: The token endpoint returned an error. Status: %1, Body: %2
es_es: El endpoint de token devolvió un error. Estado: %1, Cuerpo: %2

# Codeunit 3181614269 - NamedType 1383990408
source: The request to the token endpoint failed.
es_es: La solicitud al endpoint de token falló.

# Codeunit 3181614269 - NamedType 3046339845
source: Error uploading file to shared site: %1
es_es: Error al subir archivo al sitio compartido: %1

# Codeunit 3181614269 - NamedType 1290381575
source: Error uploading file to shared site folder: %1
es_es: Error al subir archivo a la carpeta del sitio compartido: %1

# Codeunit 1316040542 - NamedType 3967029355
source: ❌ Could not authenticate with SharePoint. Please check your credentials.
es_es: ❌ No se pudo autenticar con SharePoint. Por favor verifica tus credenciales.

# Codeunit 1316040542 - NamedType 2012072874
source: Error copying file: %1. Complete response: %2
es_es: Error al copiar archivo: %1. Respuesta completa: %2

# Codeunit 1316040542 - NamedType 3070244917
source: Error creating folder
es_es: Error al crear carpeta

# Codeunit 1316040542 - NamedType 3787551528
source: Are you sure you want to delete the folder?
es_es: ¿Estás seguro de que quieres eliminar la carpeta?

# Codeunit 1316040542 - NamedType 2174225733
source: Error opening file in browser: %1
es_es: Error al abrir archivo en el navegador: %1

# Codeunit 1316040542 - NamedType 1344636373
source: Error accessing file: %1
es_es: Error al acceder al archivo: %1

# Codeunit 1316040542 - NamedType 1147800676
source: File was copied but could not delete original. Copied file ID: %1
es_es: El archivo fue copiado pero no se pudo eliminar el original. ID del archivo copiado: %1

# Codeunit 1316040542 - NamedType 3272573609
source: Could not get file link. Check that the file ID is correct and you have permission.
es_es: No se pudo obtener el enlace del archivo. Verifica que el ID del archivo es correcto y que tienes permisos.

# Codeunit 1316040542 - NamedType 2620969216
source: Folder not found: %1
es_es: Carpeta no encontrada: %1

# Codeunit 1316040542 - NamedType 4062163994
source: No refresh token configured for SharePoint.
es_es: No se ha configurado un token de actualización para SharePoint.

# Codeunit 1316040542 - NamedType 3924427549
source: No response received from SharePoint server.
es_es: No se recibió respuesta del servidor de SharePoint.

# Codeunit 1316040542 - NamedType 1488830023
source: The token endpoint returned an error. Status: %1, Body: %2
es_es: El endpoint de token devolvió un error. Estado: %1, Cuerpo: %2

# Codeunit 1316040542 - NamedType 1383990408
source: The request to the token endpoint failed.
es_es: La solicitud al endpoint de token falló.

# Codeunit 3108067626 - NamedType 3441565095
source: Incomplete configuration. Please make sure all fields are filled.
es_es: Configuración incompleta. Por favor asegúrate de que todos los campos estén completados.

# Codeunit 3108067626 - NamedType 1622895393
source: ❌ Error connecting to Strapi API.
es_es: ❌ Error al conectar con la API de Strapi.

# Codeunit 3108067626 - NamedType 2865083016
source: ✅ Successful connection to Strapi API.\Response: %1
es_es: ✅ Conexión exitosa a la API de Strapi.\Respuesta: %1

# Codeunit 3108067626 - NamedType 3787551528
source: Are you sure you want to delete the folder?
es_es: ¿Estás seguro de que quieres eliminar la carpeta?

# Codeunit 3108067626 - NamedType 3427541496
source: File not found: %1
es_es: Archivo no encontrado: %1

# Codeunit 3108067626 - NamedType 3279271488
source: Could not get file URL.
es_es: No se pudo obtener la URL del archivo.

# Codeunit 3108067626 - NamedType 2620969216
source: Folder not found: %1
es_es: Carpeta no encontrada: %1

# Codeunit 3108067626 - NamedType 671857597
source: Error opening file in browser: %1
es_es: Error al abrir archivo en el navegador: %1

# Codeunit 3108067626 - NamedType 3568383798
source: Error uploading file to Strapi: %1
es_es: Error al subir archivo a Strapi: %1

# Page 2429493653 - Property 2879900210
source: Dialogo
es_es: Diálogo

# Page 2429493653 - Control 3192175264 - Property 2879900210
source: Enter Date
es_es: Introduzca fecha

# Page 2429493653 - Control 2688099599 - Property 2879900210
source: Enter Date
es_es: Introduzca fecha

# Page 2429493653 - Control 472720858 - Property 2879900210
source: Enter Value
es_es: Introduzca valor

# Page 2429493653 - Control 443158777 - Property 2879900210
source: Enter Value
es_es: Introduzca valor

# Page 119800846 - Property 2879900210
source: Dialogo
es_es: Diálogo

# Page 119800846 - Control 3192175264 - Property 2879900210
source: Enter date
es_es: Introduzca fecha

# Page 119800846 - Control 2688099599 - Property 2879900210
source: Enter Date
es_es: Introduzca fecha

# Page 119800846 - Control 472720858 - Property 2879900210
source: Enter Value
es_es: Introduzca valor

# Page 119800846 - Control 443158777 - Property 2879900210
source: Enter Value
es_es: Introduzca valor

# Page 778823480 - Property 2879900210
source: Storage Configuration
es_es: Configuración de Almacenamiento

# Page 778823480 - NamedType 817930516
source: Choose storage type
es_es: Elegir tipo de almacenamiento

# Page 778823480 - NamedType 351526200
source: ❌ Incomplete configuration. Please ensure all fields are filled.
es_es: ❌ Configuración incompleta. Por favor, asegúrese de que todos los campos estén llenos.

# Page 778823480 - NamedType 3013457392
source: ✅ Configuration valid.
es_es: ✅ Configuración válida.

# Page 778823480 - NamedType 3748950559
source: Default values configured successfully.
es_es: Valores por defecto configurados correctamente.

# Page 778823480 - NamedType 336829252
source: ❌ Connection error. Check configuration.
es_es: ❌ Error de conexión. Compruebe la configuración.

# Page 778823480 - NamedType 1856503709
source: ✅ DropBox connection successful.
es_es: ✅ Conexión a DropBox exitosa.

# Page 778823480 - NamedType 3241594979
source: ❌ Connection error. Check configuration.
es_es: ❌ Error de conexión. Compruebe la configuración.

# Page 778823480 - NamedType 1460576926
source: ✅ Google Drive connection successful.
es_es: ✅ Conexión a Google Drive exitosa.

# Page 778823480 - NamedType 452344817
source: Error: Permission to modify the Company Information record is missing
es_es: Error: Falta permiso para modificar el registro de Documento Adjunto

# Page 778823480 - NamedType 2380359848
source: ❌ No token configured.
es_es: ❌ No se ha configurado ningún token.

# Page 778823480 - NamedType 1720891904
source: ❌ Connection error. Check configuration.
es_es: ❌ Error de conexión. Compruebe la configuración.

# Page 778823480 - NamedType 3857374425
source: ✅ OneDrive connection successful.
es_es: ✅ Conexión a OneDrive exitosa.

# Page 778823480 - NamedType 3292684920
source: Are you sure you want to revoke Google Drive access?
es_es: ¿Está seguro de querer revocar el acceso a Google Drive?

# Page 778823480 - NamedType 1756046547
source: ❌ Connection error. Check configuration.
es_es: ❌ Error de conexión. Compruebe la configuración.

# Page 778823480 - NamedType 2177212078
source: ✅ Strapi connection successful.
es_es: ✅ Conexión a Strapi exitosa.

# Page 778823480 - NamedType 72359616
source: ❌ Token expired since: %1. Use "Refresh Token" to renew it.
es_es: ❌ Token expirado desde: %1. Use "Refresh Token" para renovarlo.

# Page 778823480 - NamedType 3563892711
source: ✅ Token valid until: %1
es_es: ✅ Token válido hasta: %1

# Page 778823480 - Control 3493556640 - Property 2879900210
source: DropBox Configuration
es_es: Configuración de DropBox

# Page 778823480 - Control 2488241142 - Property 1295455071
source: Specifies the App Key of the DropBox application.
es_es: Especifica la App Key de la aplicación DropBox.

# Page 778823480 - Control 128218221 - Property 1295455071
source: Specifies the App Secret of the DropBox application.
es_es: Especifica la App Secret de la aplicación DropBox.

# Page 778823480 - Control 2569946936 - Property 1295455071
source: Specifies the root folder of DropBox.
es_es: Especifica la carpeta raíz de DropBox.

# Page 778823480 - Control 211956657 - Property 1295455071
source: Specifies the base URL of the DropBox API.
es_es: Especifica la URL base de la API de DropBox.

# Page 778823480 - Control 414272144 - Property 2879900210
source: DropBox Tokens
es_es: Tokens de DropBox

# Page 778823480 - Control 4135971357 - Property 1295455071
source: Current access token for DropBox.
es_es: Token de acceso actual de DropBox.

# Page 778823480 - Control 2759503982 - Property 1295455071
source: Refresh token for DropBox.
es_es: Token de actualización de DropBox.

# Page 778823480 - Control 1364126888 - Property 1295455071
source: Date and time when the access token expires.
es_es: Fecha y hora de expiración del token de acceso.

# Page 778823480 - Control 1853648223 - Property 2879900210
source: Google Drive Configuration
es_es: Configuración de Google Drive

# Page 778823480 - Control 316178277 - Property 1295455071
source: Specifies the URL of the Google authentication provider certificate.
es_es: Especifica la URL del certificado del proveedor de autenticación de Google.

# Page 778823480 - Control 2951281481 - Property 1295455071
source: Specifies the authorization URI of Google OAuth.
es_es: Especifica la URI de autorización de Google OAuth.

# Page 778823480 - Control 2039669391 - Property 1295455071
source: Specifies the Client ID of the Google OAuth application.
es_es: Especifica el Client ID de la aplicación Google OAuth.

# Page 778823480 - Control 248657298 - Property 1295455071
source: Specifies the Client Secret of the Google OAuth application.
es_es: Especifica el Client Secret de la aplicación Google OAuth.

# Page 778823480 - Control 2750769655 - Property 1295455071
source: Specifies the root folder of Google Drive.
es_es: Especifica la carpeta raíz de Google Drive.

# Page 778823480 - Control 3826965379 - Property 1295455071
source: Specifies the Project ID from Google Cloud Console.
es_es: Especifica el Project ID desde Google Cloud Console.

# Page 778823480 - Control 4107414531 - Property 1295455071
source: Specifies the ID of the shared Google Drive folder.
es_es: Especifica el ID de la carpeta compartida de Google Drive.

# Page 778823480 - Control 4026808557 - Property 1295455071
source: Specifies the name of the shared Google Drive folder.
es_es: Especifica el nombre de la carpeta compartida de Google Drive.

# Page 778823480 - Control 2371736376 - Property 1295455071
source: Specifies the token URI of Google OAuth.
es_es: Especifica la URI del token de Google OAuth.

# Page 778823480 - Control 1292037474 - Property 1295455071
source: Specifies the base URL of the Google Drive API.
es_es: Especifica la URL base de la API de Google Drive.

# Page 778823480 - Control 505274087 - Property 2879900210
source: Google Drive Tokens
es_es: Tokens de Google Drive

# Page 778823480 - Control 2955373701 - Property 1295455071
source: Date and time when the access token expires.
es_es: Fecha y hora de expiración del token de acceso.

# Page 778823480 - Control 3268871981 - Property 1295455071
source: Refresh token for Google Drive.
es_es: Token de actualización para Google Drive.

# Page 778823480 - Control 2763028714 - Property 1295455071
source: Current access token for Google Drive.
es_es: Token de acceso actual para Google Drive.

# Page 778823480 - Control 2912706852 - Property 2879900210
source: OneDrive Configuration
es_es: Configuración de OneDrive

# Page 778823480 - Control 1727939672 - Property 1295455071
source: Specifies the Client ID of the OneDrive OAuth application.
es_es: Especifica el Client ID de la aplicación OneDrive OAuth.

# Page 778823480 - Control 4276756505 - Property 1295455071
source: Specifies the Client Secret of the OneDrive OAuth application.
es_es: Especifica el Client Secret de la aplicación OneDrive OAuth.

# Page 778823480 - Control 877230780 - Property 1295455071
source: Specifies the root folder of OneDrive.
es_es: Especifica la carpeta raíz de OneDrive.

# Page 778823480 - Control 2549889954 - Property 1295455071
source: Specifies the ID of the OneDrive site.
es_es: Especifica el ID del sitio de OneDrive.

# Page 778823480 - Control 3330877244 - Property 1295455071
source: Specifies the URL of the OneDrive site.
es_es: Especifica la URL del sitio de OneDrive.

# Page 778823480 - Control 2653429955 - Property 1295455071
source: Specifies the Tenant ID from Microsoft Azure.
es_es: Especifica el ID de la Tenant de Microsoft Azure.

# Page 778823480 - Control 4002845373 - Property 1295455071
source: Specifies the base URL of the OneDrive API.
es_es: Especifica la URL base de la API de OneDrive.

# Page 778823480 - Control 433240564 - Property 2879900210
source: OneDrive Tokens
es_es: Tokens de OneDrive

# Page 778823480 - Control 1887542201 - Property 1295455071
source: Current access token for OneDrive.
es_es: Token de acceso actual de OneDrive.

# Page 778823480 - Control 1599754090 - Property 1295455071
source: Refresh token for OneDrive.
es_es: Token de actualización de OneDrive.

# Page 778823480 - Control 2119495052 - Property 1295455071
source: Date and time when the access token expires.
es_es: Fecha y hora de expiración del token de acceso.

# Page 778823480 - Control 1116507555 - Property 2879900210
source: SharePoint Configuration
es_es: Configuración de SharePoint

# Page 778823480 - Control 2248734183 - Property 1295455071
source: Specifies the Client ID of the SharePoint OAuth application.
es_es: Especifica el Client ID de la aplicación SharePoint OAuth.

# Page 778823480 - Control 2104195930 - Property 1295455071
source: Specifies the Client Secret of the SharePoint OAuth application.
es_es: Especifica el Client Secret de la aplicación SharePoint OAuth.

# Page 778823480 - Control 1894561681 - Property 1295455071
source: Specifies the Site ID of SharePoint.
es_es: Especifica el Site ID de SharePoint.

# Page 778823480 - Control 76939604 - Property 1295455071
source: Specifies the Tenant ID from Microsoft Azure.
es_es: Especifica el Tenant ID de Microsoft Azure.

# Page 778823480 - Control 800046590 - Property 1295455071
source: Specifies the base URL of the SharePoint API.
es_es: Especifica la URL base de la API de SharePoint.

# Page 778823480 - Control 3556778891 - Property 2879900210
source: SharePoint Tokens
es_es: Tokens de SharePoint

# Page 778823480 - Control 1706501090 - Property 1295455071
source: Current access token for SharePoint.
es_es: Token de acceso actual de SharePoint.

# Page 778823480 - Control 1713108105 - Property 1295455071
source: Refresh token for SharePoint.
es_es: Token de actualización de SharePoint.

# Page 778823480 - Control 2682310627 - Property 1295455071
source: Date and time when the access token expires.
es_es: Fecha y hora de expiración del token de acceso.

# Page 778823480 - Control 745197316 - Property 2879900210
source: Storage Provider
es_es: Proveedor de almacenamiento

# Page 778823480 - Control 1869379388 - Property 1295455071
source: Select the data storage provider to use.
es_es: Selecciona el proveedor de almacenamiento a usar.

# Page 778823480 - Control 1159926083 - Property 1295455071
source: Specifies if extended functionality is enabled.
es_es: Especifica si la funcionalidad extendida está habilitada.

# Page 778823480 - Control 3566609903 - Property 2879900210
source: Strapi Configuration
es_es: Configuración de Strapi

# Page 778823480 - Control 3771291026 - Property 1295455071
source: Specifies the API token of Strapi.
es_es: Especifica el token de API de Strapi.

# Page 778823480 - Control 3547209069 - Property 1295455071
source: Specifies the base URL of the Strapi API.
es_es: Especifica la URL base de la API de Strapi.

# Page 778823480 - Control 293695152 - Property 1295455071
source: Specifies the collection name in Strapi.
es_es: Especifica el nombre de la colección en Strapi.

# Page 778823480 - Control 3531253518 - Property 1295455071
source: Specifies the Strapi password.
es_es: Especifica la contraseña de Strapi.

# Page 778823480 - Control 1947287909 - Property 1295455071
source: Specifies the Strapi username.
es_es: Especifica el nombre de usuario de Strapi.

# Page 778823480 - Action 1075519995 - Property 1295455071
source: Update the access token using the refresh token.
es_es: Actualiza el token de acceso usando el refresh token.

# Page 778823480 - Action 1075519995 - Property 2879900210
source: Update Token
es_es: Actualizar Token

# Page 778823480 - Action 479297613 - Property 1295455071
source: Starts the OAuth authentication process with DropBox.
es_es: Inicia el proceso de autenticación OAuth con DropBox.

# Page 778823480 - Action 479297613 - Property 2879900210
source: Start OAuth
es_es: Iniciar OAuth

# Page 778823480 - Action 249976424 - Property 1295455071
source: Tests the connection with DropBox using the current configuration.
es_es: Prueba la conexión con DropBox usando la configuración actual.

# Page 778823480 - Action 249976424 - Property 2879900210
source: Test Connection
es_es: Prueba de conexión

# Page 778823480 - Action 1502845774 - Property 1295455071
source: Validates that all configuration fields are complete.
es_es: Valida que todos los campos de configuración estén completos.

# Page 778823480 - Action 1502845774 - Property 2879900210
source: Validate Configuration
es_es: Validar configuración

# Page 778823480 - Action 1598643727 - Property 1295455071
source: Configures which Google Drive folders to use for each document type.
es_es: Configura las carpetas de Google Drive a usar para cada tipo de documento.

# Page 778823480 - Action 1598643727 - Property 2879900210
source: Configure Folder Mapping
es_es: Configurar mapeo de carpetas

# Page 778823480 - Action 224791858 - Property 1295455071
source: Configures default values for the connection with Google Drive.
es_es: Configura valores predeterminados para la conexión con Google Drive.

# Page 778823480 - Action 224791858 - Property 2879900210
source: Configure Default Settings
es_es: Configurar valores predeterminados

# Page 778823480 - Action 448587573 - Property 1295455071
source: Performs a complete diagnosis of the OAuth configuration to identify issues.
es_es: Realiza un diagnóstico completo de la configuración OAuth para identificar problemas.

# Page 778823480 - Action 448587573 - Property 2879900210
source: Diagnose OAuth Configuration
es_es: Diagnóstico de configuración OAuth

# Page 778823480 - Action 1017147968 - Property 1295455071
source: Allows manual editing of token fields.
es_es: Permite la edición manual de campos de token.

# Page 778823480 - Action 1017147968 - Property 2879900210
source: Enable Manual Token Entry
es_es: Habilitar entrada manual de token

# Page 778823480 - Action 1290520911 - Property 1295455071
source: Completes the OAuth authentication process with the authorization code.
es_es: Completa el proceso de autenticación OAuth con el código de autorización.

# Page 778823480 - Action 1290520911 - Property 2879900210
source: Get Token
es_es: Obtener token

# Page 778823480 - Action 3780295592 - Property 1295455071
source: Gets the ID of the Google Drive site.
es_es: Obtiene el ID del sitio de Google Drive.

# Page 778823480 - Action 2595669717 - Property 1295455071
source: Release the Google Drive Id.
es_es: Liberar el ID de Google Drive.

# Page 778823480 - Action 2595669717 - Property 2879900210
source: Release Google Drive Id
es_es: Liberar ID de Google Drive

# Page 778823480 - Action 1513319962 - Property 1295455071
source: Refreshes the access token using the refresh token.
es_es: Actualiza el token de acceso usando el token de actualización.

# Page 778823480 - Action 1513319962 - Property 2879900210
source: Refresh Token
es_es: Actualizar token

# Page 778823480 - Action 3793333624 - Property 1295455071
source: Revokes access to Google Drive and clears stored tokens.
es_es: Revoca el acceso a Google Drive y borra los tokens almacenados.

# Page 778823480 - Action 3793333624 - Property 2879900210
source: Revoke Access
es_es: Revocar acceso

# Page 778823480 - Action 504993807 - Property 1295455071
source: Starts the OAuth authentication process with Google Drive.
es_es: Inicia el proceso de autenticación OAuth con Google Drive.

# Page 778823480 - Action 504993807 - Property 2879900210
source: Start OAuth Flow
es_es: Iniciar flujo OAuth

# Page 778823480 - Action 1818131690 - Property 1295455071
source: Opens Google OAuth Playground to obtain tokens manually.
es_es: Abre el Google OAuth Playground para obtener tokens manualmente.

# Page 778823480 - Action 1818131690 - Property 2879900210
source: Use OAuth Playground (Recommended)
es_es: Usar OAuth Playground (Recomendado)
