Repository: AndreuSerraCandela/GoogleDrive
Catalog: Translations/GoogleDrive.*.xlf
Languages: es_es

# Table 1163388225 - Property 2879900210
source: Folder Mapping
es_es: Mapeo de Carpetas

# Table 1163388225 - NamedType 1902168033
source: Are you sure you want to rename folder?
es_es: ¿Está seguro de querer renombrar la carpeta?

# Table 1163388225 - NamedType 3460270774
source: Default mappings created successfully.
es_es: Configuraciones por defecto creadas exitosamente.

# Table 1163388225 - Field 1090351696 - Property 2879900210
source: Active
es_es: Activo

# Table 1163388225 - Field 825495798 - Property 1295455071
source: If enabled, it will automatically create subfolders based on the document number.
es_es: Si está habilitado, creará automáticamente subcarpetas basadas en el número de documento.

# Table 1163388225 - Field 825495798 - Property 2879900210
source: Auto Create Subfolders
es_es: Crear Subcarpetas Automáticamente

# Table 1163388225 - Field 2500892784 - Property 2879900210
source: Created Date
es_es: Fecha de Creación

# Table 1163388225 - Field 1127021900 - Property 1295455071
source: Specifies the ID of the Drive folder where files for this table will be stored by default.
es_es: Especifica el ID de la carpeta de Drive donde se almacenarán los archivos de esta tabla por defecto.

# Table 1163388225 - Field 1127021900 - Property 2879900210
source: Default Folder ID
es_es: ID de Carpeta por Defecto

# Table 1163388225 - Field 141400118 - Property 1295455071
source: Specifies the name of the Drive folder (for reference only).
es_es: Especifica el nombre de la carpeta de Drive (solo para referencia).

# Table 1163388225 - Field 141400118 - Property 2879900210
source: Default Folder Name
es_es: Nombre de Carpeta por Defecto

# Table 1163388225 - Field 3461834954 - Property 1295455071
source: Optional description for this configuration.
es_es: Descripción opcional para esta configuración.

# Table 1163388225 - Field 3461834954 - Property 2879900210
source: Description
es_es: Descripción

# Table 1163388225 - Field 699646855 - Property 2879900210
source: Modified Date
es_es: Fecha de Modificación

# Table 1163388225 - Field 2782705678 - Property 1295455071
source: Pattern for creating subfolders. Use {DOCNO} for document number, {NO} for Code, {YEAR} for year, {MONTH} for month.
es_es: Patrón para crear subcarpetas. Use {DOCNO} para número de documento, {NO} para Código, {YEAR} para año, {MONTH} para mes.

# Table 1163388225 - Field 2782705678 - Property 2879900210
source: Subfolder Pattern
es_es: Patrón de Subcarpeta

# Table 1163388225 - Field 3135334477 - Property 2879900210
source: Table ID
es_es: ID de Tabla

# Table 1163388225 - Field 3808951907 - Property 2879900210
source: Table Name
es_es: Nombre de Tabla

# Codeunit 3098052707 - NamedType 452344817
source: Error: Permission to modify the Document Attachment record is missing
es_es: Error: Falta permiso para modificar el registro de Documento Adjunto

# Codeunit 4285443769 - NamedType 3967029355
source: ❌ Could not authenticate with DropBox. Please check your credentials.
es_es: ❌ No se pudo autenticar con DropBox. Por favor verifica tus credenciales.

# Codeunit 4285443769 - NamedType 3070244917
source: Error creating folder
es_es: Error al crear carpeta

# Codeunit 4285443769 - NamedType 3787551528
source: Are you sure you want to delete the folder?
es_es: ¿Estás seguro de que quieres eliminar la carpeta?

# Codeunit 4285443769 - NamedType 2057920291
source: DropBox Code
es_es: Código de DropBox

# Codeunit 4285443769 - NamedType 2174225733
source: Error opening file in browser: %1
es_es: Error al abrir archivo en el navegador: %1

# Codeunit 4285443769 - NamedType 1344636373
source: Error accessing file: %1
es_es: Error al acceder al archivo: %1

# Codeunit 4285443769 - NamedType 3272573609
source: Could not get file link. Check that the file ID is correct and you have permission.
es_es: No se pudo obtener el enlace del archivo. Verifica que el ID del archivo sea correcto y que tengas permisos.

# Codeunit 4285443769 - NamedType 2620969216
source: Folder not found: %1
es_es: Carpeta no encontrada: %1

# Codeunit 4285443769 - NamedType 4062163994
source: No refresh token configured for DropBox.
es_es: No hay token de actualización configurado para DropBox.

# Codeunit 4285443769 - NamedType 3924427549
source: No response received from DropBox server.
es_es: No se recibió respuesta del servidor de DropBox.

# Codeunit 4285443769 - NamedType 3568383798
source: Error uploading file to Strapi: %1
es_es: Error al subir archivo a Strapi: %1

# Codeunit 3881318298 - NamedType 510923899
source: Google Drive access revoked successfully.
es_es: Acceso a Google Drive revocado exitosamente.

# Codeunit 3881318298 - NamedType 2865341882
source: ✅ All credentials are present and have appropriate length
es_es: ✅ Todas las credenciales están presentes y tienen longitud apropiada

# Codeunit 3881318298 - NamedType 3522907960
source: Authentication completed successfully.
es_es: Autenticación completada exitosamente.

# Codeunit 3881318298 - NamedType 1750788999
source: Authentication error: %1
es_es: Error de autenticación: %1

# Codeunit 3881318298 - NamedType 262874476
source: Browser has been opened for authorization. If it doesn't open automatically, copy this URL:\%1
es_es: El navegador ha sido abierto para autorización. Si no se abre automáticamente, copia esta URL:\%1

# Codeunit 3881318298 - NamedType 4052508136
source: Client ID is empty
es_es: El ID de cliente está vacío

# Codeunit 3881318298 - NamedType 3953412576
source: ❌ EMPTY
es_es: ❌ VACÍO

# Codeunit 3881318298 - NamedType 2869387891
source: Client ID: %1 characters
es_es: ID de cliente: %1 caracteres

# Codeunit 3881318298 - NamedType 459746967
source: ✅ LENGTH OK
es_es: ✅ LONGITUD OK

# Codeunit 3881318298 - NamedType 1244607689
source: ⚠️ TOO LONG
es_es: ⚠️ DEMASIADO LARGO

# Codeunit 3881318298 - NamedType 2209807041
source: Client ID seems too short (should be ~72 characters)
es_es: El ID de cliente parece demasiado corto (debe ser ~72 caracteres)

# Codeunit 3881318298 - NamedType 2043746985
source: ⚠️ TOO SHORT
es_es: ⚠️ DEMASIADO CORTO

# Codeunit 3881318298 - NamedType 164318649
source: Client Secret is empty
es_es: El secreto de cliente está vacío

# Codeunit 3881318298 - NamedType 3652078577
source: ❌ EMPTY
es_es: ❌ VACÍO

# Codeunit 3881318298 - NamedType 787018254
source: Client Secret: %1 characters
es_es: Secreto de cliente: %1 caracteres

# Codeunit 3881318298 - NamedType 3390914146
source: ✅ LENGTH OK
es_es: ✅ LONGITUD OK

# Codeunit 3881318298 - NamedType 3560800808
source: ⚠️ TOO LONG
es_es: ⚠️ DEMASIADO LARGO

# Codeunit 3881318298 - NamedType 1837209656
source: Client Secret seems too short (should be ~24 characters)
es_es: El secreto de cliente parece demasiado corto (debe ser ~24 caracteres)

# Codeunit 3881318298 - NamedType 2603649712
source: ⚠️ TOO SHORT
es_es: ⚠️ DEMASIADO CORTO

# Codeunit 3881318298 - NamedType 4135563637
source: Google Drive configuration is incomplete. Please configure Client ID and Client Secret in company information.
es_es: La configuración de Google Drive está incompleta. Por favor, configura el ID de cliente y el secreto de cliente en la información de la empresa.

# Codeunit 3881318298 - NamedType 1622895393
source: ❌ Connection error: Could not connect to Google server.
es_es: ❌ Error de conexión: No se pudo conectar al servidor de Google.

# Codeunit 3881318298 - NamedType 2012072874
source: Error copying file
es_es: Error al copiar el archivo

# Codeunit 3881318298 - NamedType 748651172
source: Please copy the following URL to your browser to authorize Google Drive access:\%1
es_es: Por favor copia la siguiente URL en tu navegador para autorizar el acceso a Google Drive:\%1

# Codeunit 3881318298 - NamedType 2614467345
source: Error creating folder
es_es: Error al crear carpeta

# Codeunit 3881318298 - NamedType 21791626
source: Error creating folder in shared drive: %1 with this URL: %2 and this JSON: %3
es_es: Error al crear carpeta en un drive compartido: %1 con esta URL: %2 y este JSON: %3

# Codeunit 3881318298 - NamedType 1460081587
source: ❌ Credential error: %1\Please verify configuration in Company Information.
es_es: ❌ Error de credenciales: %1\Por favor verifica la configuración en Información de la Empresa.

# Codeunit 3881318298 - NamedType 3472466796
source: 📋 CREDENTIALS:
es_es: 📋 CREDENCIALES:

# Codeunit 3881318298 - NamedType 3787551528
source: Are you sure you want to delete the folder?
es_es: ¿Estás seguro de que quieres eliminar la carpeta?

# Codeunit 3881318298 - NamedType 1091420530
source: Are you sure you want to delete forder?
es_es: ¿Estás seguro de que quieres eliminar la carpeta?

# Codeunit 3881318298 - NamedType 1541016018
source: 🔍 OAUTH CONFIGURATION DIAGNOSTIC
es_es: 🔍 DIAGNÓSTICO DE CONFIGURACIÓN OAUTH

# Codeunit 3881318298 - NamedType 888858801
source: Error accessing file: %1
es_es: Error al acceder al archivo: %1

# Codeunit 3881318298 - NamedType 1344636373
source: Error accessing file: %1
es_es: Error al acceder al archivo: %1

# Codeunit 3881318298 - NamedType 523503389
source: Could not get file link. Verify that the file ID is correct and you have permission to access it.
es_es: No se pudo obtener el enlace del archivo. Verifique que el ID del archivo sea correcto y que tenga permisos para acceder a él.

# Codeunit 3881318298 - NamedType 1022768992
source: Error uploading file: %1
es_es: Error al subir archivo: %1

# Codeunit 3881318298 - NamedType 488998183
source: Could not get file link.
es_es: No se pudo obtener el enlace del archivo.

# Codeunit 3881318298 - NamedType 2420157743
source: Error getting shared drives: %1
es_es: Error al obtener los drives compartidos: %1

# Codeunit 3881318298 - NamedType 531481100
source: ❌ INVALID CREDENTIALS ERROR\Error: %1\🔧 POSSIBLE SOLUTIONS:\1. VERIFY CREDENTIALS IN OAUTH PLAYGROUND:\ - Make sure you have checked "Use your own OAuth credentials"\ - Verify that Client ID and Secret are exactly the same\2. VERIFY CONFIGURATION IN GOOGLE CLOUD CONSOLE:\ - Client ID must be enabled\ - Project must be in "In production" or "Testing" status\3. REGENERATE TOKENS:\ - Use "OAuth Playground" to get new tokens\ - Make sure to use YOUR credentials, not playground ones\Current Client ID: %2
es_es: ❌ ERROR DE CREDENCIALES INVÁLIDAS\Error: %1\🔧 POSIBLES SOLUCIONES:\1. VERIFICAR CREDENCIALES EN OAUTH PLAYGROUND:\ - Asegúrate de haber marcado "Use your own OAuth credentials"\ - Verifica que Client ID y Secret sean exactamente iguales\2. VERIFICAR CONFIGURACIÓN EN GOOGLE CLOUD CONSOLE:\ - Client ID debe estar habilitado\ - El proyecto debe estar en estado "In production" o "Testing"\3. REGENERAR TOKENS:\ - Usa "OAuth Playground" para obtener nuevos tokens\ - Asegúrate de usar TUS credenciales, no las del playground\Client ID actual: %2

# Codeunit 3881318298 - NamedType 779677159
source: Invalid security state. Please restart the authentication process.
es_es: Estado de seguridad inválido. Por favor, reinicia el proceso de autenticación.

# Codeunit 3881318298 - NamedType 539753160
source: Error: Could not parse JSON response: %1
es_es: Error: No se pudo analizar la respuesta JSON: %1

# Codeunit 3881318298 - NamedType 452344817
source: Error: Permission to modify the Document Attachment record is missing
es_es: Error: Falta permiso para modificar el registro de Documento Adjunto

# Codeunit 3881318298 - NamedType 2646310046
source: Error moving file
es_es: Error al mover el archivo

# Codeunit 3881318298 - NamedType 3266331046
source: Error moving folder
es_es: Error al mover la carpeta

# Codeunit 3881318298 - NamedType 1057275809
source: Error: access_token not found in response: %1
es_es: Error: access_token no encontrado en la respuesta: %1

# Codeunit 3881318298 - NamedType 888619065
source: No expiration date ❌
es_es: Sin fecha de expiración ❌

# Codeunit 3881318298 - NamedType 4062163994
source: No refresh token available. Please complete the OAuth authentication process first.
es_es: No hay token de actualización disponible. Por favor completa primero el proceso de autenticación OAuth.

# Codeunit 3881318298 - NamedType 1680919470
source: No response received from Google Drive server.
es_es: No se recibió respuesta del servidor de Google Drive.

# Codeunit 3881318298 - NamedType 3106542267
source: Error authenticating with Google Drive. Please check your credentials.
es_es: Error al autenticar con Google Drive. Por favor, verifica tus credenciales.

# Codeunit 3881318298 - NamedType 3158183642
source: ⚠️ IMPORTANT: You must configure YOUR credentials, not playground ones
es_es: ⚠️ IMPORTANTE: Debes configurar TUS credenciales, no las del playground

# Codeunit 3881318298 - NamedType 3906493109
source: CONFIGURE OAUTH PLAYGROUND WITH YOUR CREDENTIALS:\⚠️ IMPORTANT: You must configure YOUR credentials, not playground ones\1. Open this URL: %1\2. 🔧 CONFIGURE CREDENTIALS (CRITICAL STEP):\ - In the UPPER RIGHT corner, click the ⚙️ icon (Settings)\ - ✅ Check the "Use your own OAuth credentials" box\ - OAuth Client ID: %2\ - OAuth Client Secret: %3\ - Click "Close" to save\3. 📋 SELECT APIS:\ - In the left panel, search for "Drive API v3"\ - Expand the section and select:\ ✅ https://www.googleapis.com/auth/drive\ ✅ https://www.googleapis.com/auth/drive.file\4. 🔐 AUTHORIZE:\ - Click "Authorize APIs"\ - Sign in with your Google account\ - Authorize access\5. 🎫 GET TOKENS:\ - Click "Exchange authorization code for tokens"\ - Copy the "access_token" and "refresh_token"\6. 📝 CONFIGURE IN BUSINESS CENTRAL:\ - Paste the tokens in the corresponding fields\ - Use "Test Token Validity" to verify
es_es: CONFIGURAR OAUTH PLAYGROUND CON TUS CREDENCIALES:\⚠️ IMPORTANTE: Debes configurar TUS credenciales, no las del playground\1. Abre esta URL: %1\2. 🔧 CONFIGURAR CREDENCIALES (PASO CRÍTICO):\ - En la esquina SUPERIOR DERECHA, haz clic en el icono ⚙️ (Configuración)\ - ✅ Marca la casilla "Use your own OAuth credentials"\ - OAuth Client ID: %2\ - OAuth Client Secret: %3\ - Haz clic en "Close" para guardar\3. 📋 SELECCIONAR APIS:\ - En el panel izquierdo, busca "Drive API v3"\ - Expande la sección y selecciona:\ ✅ https://www.googleapis.com/auth/drive\ ✅ https://www.googleapis.com/auth/drive.file\4. 🔐 AUTORIZAR:\ - Haz clic en "Authorize APIs"\ - Inicia sesión con tu cuenta de Google\ - Autoriza el acceso\5. 🎫 OBTENER TOKENS:\ - Haz clic en "Exchange authorization code for tokens"\ - Copia el "access_token" y "refresh_token"\6. 📝 CONFIGURAR EN BUSINESS CENTRAL:\ - Pega los tokens en los campos correspondientes\ - Usa "Test Token Validity" para verificar

# Codeunit 3881318298 - NamedType 1218063317
source: CONFIGURE OAUTH PLAYGROUND WITH YOUR CREDENTIALS:
es_es: CONFIGURAR OAUTH PLAYGROUND CON TUS CREDENCIALES:

# Codeunit 3881318298 - NamedType 2394278367
source: Google OAuth Playground has been opened.\⚠️ REMEMBER: You must configure YOUR credentials in Settings (⚙️)\Complete instructions: %1
es_es: Google OAuth Playground ha sido abierto.\⚠️ RECUERDA: Debes configurar TUS credenciales en Configuración (⚙️)\Instrucciones completas: %1

# Codeunit 3881318298 - NamedType 2388723277
source: 1. Open this URL: %1
es_es: 1. Abre esta URL: %1

# Codeunit 3881318298 - NamedType 3035418027
source: - In the UPPER RIGHT corner, click the ⚙️ icon (Settings)
es_es: - En la esquina SUPERIOR DERECHA, haz clic en el icono ⚙️ (Configuración)

# Codeunit 3881318298 - NamedType 1480747070
source: - ✅ Check the "Use your own OAuth credentials" box
es_es: - ✅ Marca la casilla "Use your own OAuth credentials"

# Codeunit 3881318298 - NamedType 2623578087
source: - Click "Close" to save
es_es: - Haz clic en "Close" para guardar

# Codeunit 3881318298 - NamedType 4272272932
source: 2. 🔧 CONFIGURE CREDENTIALS (CRITICAL STEP):
es_es: 2. 🔧 CONFIGURAR CREDENCIALES (PASO CRÍTICO):

# Codeunit 3881318298 - NamedType 775073812
source: - In the left panel, search for "Drive API v3"
es_es: - En el panel izquierdo, busca "Drive API v3"

# Codeunit 3881318298 - NamedType 1855723557
source: - Expand the section and select:
es_es: - Expande la sección y selecciona:

# Codeunit 3881318298 - NamedType 4202810043
source: 3. 📋 SELECT APIS:
es_es: 3. 📋 SELECCIONAR APIS:

# Codeunit 3881318298 - NamedType 2931116953
source: - Click "Authorize APIs"
es_es: - Haz clic en "Authorize APIs"

# Codeunit 3881318298 - NamedType 3297882536
source: - Sign in with your Google account
es_es: - Inicia sesión con tu cuenta Google

# Codeunit 3881318298 - NamedType 654633463
source: - Authorize access
es_es: - Autoriza el acceso

# Codeunit 3881318298 - NamedType 1014021458
source: 4. 🔐 AUTHORIZE:
es_es: 4. 🔐 AUTORIZAR:

# Codeunit 3881318298 - NamedType 670772738
source: - Click "Exchange authorization code for tokens"
es_es: - Haz clic en "Exchange authorization code for tokens"

# Codeunit 3881318298 - NamedType 3672859023
source: - Copy the "access_token" and "refresh_token"
es_es: - Copia el "access_token" y "refresh_token"

# Codeunit 3881318298 - NamedType 3345814377
source: 5. 🎫 GET TOKENS:
es_es: 5. 🎫 OBTENER TOKENS:

# Codeunit 3881318298 - NamedType 1387381767
source: - Paste the tokens in the corresponding fields
es_es: - Pega los tokens en los campos correspondientes

# Codeunit 3881318298 - NamedType 575041434
source: - Use "Test Token Validity" to verify
es_es: - Usa "Test Token Validity" para verificar

# Codeunit 3881318298 - NamedType 3066316544
source: 6. 📝 CONFIGURE IN BUSINESS CENTRAL:
es_es: 6. 📝 CONFIGURAR EN BUSINESS CENTRAL:

# Codeunit 3881318298 - NamedType 3481679578
source: Refresh Token is empty
es_es: El Refresh Token está vacío

# Codeunit 3881318298 - NamedType 1104323314
source: ❌ EMPTY
es_es: ❌ VACÍO

# Codeunit 3881318298 - NamedType 1060326037
source: Refresh Token: %1 characters
es_es: Refresh Token: %1 caracteres

# Codeunit 3881318298 - NamedType 1445447961
source: ✅ LENGTH OK
es_es: ✅ LONGITUD OK

# Codeunit 3881318298 - NamedType 2508789927
source: ⚠️ TOO SHORT
es_es: ⚠️ DEMASIADO CORTO

# Codeunit 3881318298 - NamedType 3931227290
source: Could not connect to Google authentication server.
es_es: No se pudo conectar al servidor de autenticación de Google.

# Codeunit 3881318298 - NamedType 2901452736
source: Error accessing shared drive: %1
es_es: Error al acceder a la unidad compartida: %1

# Codeunit 3881318298 - NamedType 1228771012
source: Error accessing shared drive: %1
es_es: Error al acceder a la unidad compartida: %1

# Codeunit 3881318298 - NamedType 3712563720
source: Error accessing shared drive: %1
es_es: Error al acceder a la unidad compartida: %1

# Codeunit 3881318298 - NamedType 1239077899
source: Shared drive ID is not configured. Please configure the shared drive ID in the company.
es_es: El ID de la unidad compartida no está configurado. Por favor, configura el ID de la unidad compartida en la empresa.

# Codeunit 3881318298 - NamedType 2175948975
source: Expired since: %1 ❌
es_es: Expirado desde: %1 ❌

# Codeunit 3881318298 - NamedType 3693459255
source: Could not get token
es_es: No se pudo obtener el token

# Codeunit 3881318298 - NamedType 516263750
source: Tokens configured manually successfully.
es_es: Tokens configurados manualmente exitosamente.

# Codeunit 3881318298 - NamedType 4282847223
source: Tokens configured manually successfully.
es_es: Tokens configurados manualmente exitosamente.

# Codeunit 3881318298 - NamedType 1433074641
source: ⏰ TOKEN STATUS:
es_es: ⏰ ESTADO DEL TOKEN:

# Codeunit 3881318298 - NamedType 1349321265
source: ✅ Token updated successfully. New token expires: %1
es_es: ✅ Token actualizado exitosamente. El nuevo token expira: %1

# Codeunit 3881318298 - NamedType 2427511813
source: ❌ Error updating token (Code: %1): %2\Complete response: %3
es_es: ❌ Error al actualizar token (Código: %1): %2\Respuesta completa: %3

# Codeunit 3881318298 - NamedType 2861383863
source: ❌ Error updating token (Code: %1): %2
es_es: ❌ Error al actualizar token (Código: %1): %2

# Codeunit 3881318298 - NamedType 81880412
source: Could not update token automatically. Please configure a new token.
es_es: No se pudo actualizar el token automáticamente. Por favor configura un nuevo token.

# Codeunit 3881318298 - NamedType 74756384
source: Valid until: %1 ✅
es_es: Válido hasta: %1 ✅

# Codeunit 3881318298 - NamedType 3713120417
source: Unknown error
es_es: Error desconocido

# Codeunit 3881318298 - NamedType 2196585940
source: Error uploading file
es_es: Error al subir el archivo

# Codeunit 3881318298 - NamedType 2057219997
source: Error uploading file to shared drive: %1
es_es: Error al subir el archivo a la unidad compartida: %1

# Codeunit 3881318298 - NamedType 3384076123
source: Error uploading file to shared drive: %1
es_es: Error al subir el archivo a la unidad compartida: %1

# Codeunit 3181614269 - NamedType 1053074267
source: Could not authenticate with OneDrive. Please verify your credentials.
es_es: No se pudo autenticar con OneDrive. Por favor verifica tus credenciales.

# Codeunit 3181614269 - NamedType 2012072874
source: Error copying file: %1. Complete response: %2
es_es: Error al copiar archivo: %1. Respuesta completa: %2

# Codeunit 3181614269 - NamedType 1286512446
source: Error copying file: %1. Complete response: %2
es_es: Error al copiar archivo: %1. Respuesta completa: %2

# Codeunit 3181614269 - NamedType 1242972679
source: Could not copy file
es_es: No se pudo copiar el archivo

# Codeunit 3181614269 - NamedType 545257947
source: Could not copy file
es_es: No se pudo copiar el archivo

# Codeunit 3181614269 - NamedType 2614467345
source: Failed to create folder in OneDrive: %1 with this URL: %2 and this JSON: %3
es_es: Error al crear carpeta en OneDrive: %1 con esta URL: %2 y este JSON: %3

# Codeunit 3181614269 - NamedType 3070244917
source: Failed to create folder in OneDrive: %1 with this URL: %2 and this JSON: %3
es_es: Error al crear carpeta en OneDrive: %1 con esta URL: %2 y este JSON: %3

# Codeunit 3181614269 - NamedType 2358342498
source: Error creating folder in shared site: %1 with this URL: %2 and this JSON: %3
es_es: Error al crear carpeta en sitio compartido: %1 con esta URL: %2 y este JSON: %3

# Codeunit 3181614269 - NamedType 3787551528
source: Are you sure you want to delete the folder?
es_es: ¿Estás seguro de que quieres eliminar la carpeta?

# Codeunit 3181614269 - NamedType 1091420530
source: Are you sure you want to delete folder?
es_es: ¿Estás seguro de que quieres eliminar la carpeta?

# Codeunit 3181614269 - NamedType 888858801
source: Error accessing file: %1
es_es: Error al acceder al archivo: %1

# Codeunit 3181614269 - NamedType 2119728480
source: File was copied but could not delete original. Copied file ID: %1
es_es: El archivo fue copiado pero no se pudo eliminar el original. ID del archivo copiado: %1

# Codeunit 3181614269 - NamedType 1147800676
source: File was copied but could not delete original. Copied file ID: %1
es_es: El archivo fue copiado pero no se pudo eliminar el original. ID del archivo copiado: %1

# Codeunit 3181614269 - NamedType 523503389
source: Could not get file link. Verify that the file ID is correct and you have permission to access it.
es_es: No se pudo obtener el enlace del archivo. Verifique que el ID del archivo sea correcto y que tenga permisos para acceder a él.

# Codeunit 3181614269 - NamedType 3272573609
source: Could not get file link. Check that the file ID is correct and you have permission to access it.
es_es: No se pudo obtener el enlace del archivo. Verifica que el ID del archivo sea correcto y que tengas permisos para acceder a él.

# Codeunit 3181614269 - NamedType 2620969216
source: Folder not found: %1
es_es: Carpeta no encontrada: %1

# Codeunit 3181614269 - NamedType 1656320076
source: Could not get file path
es_es: No se pudo obtener la ruta del archivo

# Codeunit 3181614269 - NamedType 4092907192
source: Could not get file path
es_es: No se pudo obtener la ruta del archivo
